/*******************************************************************************
 * LlcMain.c
 *
 *  Created on: 2019-11-15
 *      Author: Gavin.D
*******************************************************************************/
#include "LlcMain.h"

/*******************************************************************************
**                                全局变量
*******************************************************************************/
const Uint16 DeBug = 0;	//单板调试标志,非0有效
Uint16 DeBugTIMECUNT = 5000;//计时
extern Uint16 ee_ReadByte(Uint8 *_pReadBuf,  Uint16 _usAddress, Uint16 _usSize);
/*******************************************************************************
** 函数名称:    main
** 函数功能:    主函数
** 形式参数:    无
** 返回参数:    无
*******************************************************************************/
void main(void)
{
// -----------------------------------------------------------------------------
// 系统初始化
// -----------------------------------------------------------------------------

    InitSysCtrl();          // 系统初始化:PLL, WatchDog, 外设时钟,Flash初始化
    InitGpio();             // 初始化IO引脚
//	   if(ee_ReadByte(&gCurveNum, 0, 1))
//	   {
//		   ReadExteCurve();
//	   }
    DINT;                   // 先禁用全局中断
    InitPieCtrl();          // 初始化PIE寄存器
    IER = 0x0000;           // 全中断寄存器初始化
    IFR = 0x0000;
    InitPieVectTable();     // PIE中断向量表初始化,尽管绝大多数中断函数并未使用

    // 把自定义的要放到RAM区执行的函数复制到RAM区
    MemCopy(&RammanualLoadStart, &RammanualLoadEnd, &RammanualRunStart);
// -----------------------------------------------------------------------------
// 设备、参数、全局变量初始化
// -----------------------------------------------------------------------------
    GlobalVarInit();
    DeviceInit();

// -----------------------------------------------------------------------------
// 初始化看门狗
// -----------------------------------------------------------------------------
    ServiceDog();   // Reset the watchdog counter
    EALLOW;
    SysCtrlRegs.WDCR = 0x002F;
    EDIS;
// -----------------------------------------------------------------------------
// 启用全局中断和高优先级的实时调试事件
// -----------------------------------------------------------------------------
    EINT;   // 启用全局中断
    ERTM;   // 启用实时调试中断
    ServiceDog();

///初始化时钟，仅仅在出厂或最终装机（RTC电子）正常后烧录一次即可屏蔽再次烧录即可生效////////////////////////
/////初始化设定值是按照十六进制写入，
/////64分就是40分；
/////9点就是9点；20年却要写入0x20

/*
    DS1338_WriteByte(0,0x0);////second
    DS1338_WriteByte(0x1,0x10);/////mintu
    DS1338_WriteByte(0x2,0x11);///Hour
    DS1338_WriteByte(0x4,0x15);////data 1-31
    DS1338_WriteByte(0x5,0x10);/// Month
    DS1338_WriteByte(0x6,0x20);////YEAR//0-99
*/

    ///////////////////////////
// -----------------------------------------------------------------------------
// 主循环
// -----------------------------------------------------------------------------
    while(1)
    {
       // if(0 == GpioDataRegs.GPADAT.bit.GPIO19)
            SET_KPAW;//防行走继电器吸合
       // else
          //  CLR_KPAW;
        LlcFlow();
    }
}
