/*******************************************************************************
 * LlcSci.c
 *
 *  Created on: 2019-11-15
 *      Author: Gavin.D
*******************************************************************************/
#include "LlcSci.h"

/*******************************************************************************
**                               宏定义
*******************************************************************************/

/*******************************************************************************
**                               相关结构体
*******************************************************************************/

/*******************************************************************************
**                               变量声明
*******************************************************************************/

/*******************************************************************************
**                               函数声明
*******************************************************************************/
void SciInit(void);

/*******************************************************************************
** 函数名称:    InitPwm
** 函数功能:    PWM初始化
** 形式参数:    无
** 返回参数:    无
*******************************************************************************/
void SciInit(void)
{
    InitSciaGpio();
    SciaRegs.SCICTL1.bit.SWRESET = 0;

    SciaRegs.SCICCR.all =0x0007;   // 1 stop bit,  No loopback
                                   // No parity,8 char bits,
                                   // async mode, idle-line protocol
    // baud = LSPCLK/8/((BRR+1)
    // baud @LSPCLK = 15MHz (60 MHz SYSCLK)
    SciaRegs.SCIHBAUD    =0x0000;
    SciaRegs.SCILBAUD    =15;//15; //115200     //0XC2-->9600 ; 97--> 19200 ;0x30-->38400;14-->128000
    //256000*8=2048000;  2048000/115200=18S    在115200的速度下要用18才能把数据全部复制到U盘中
    SciaRegs.SCICTL1.bit.SWRESET = 1;     // Relinquish SCI from Reset
    SciaRegs.SCIFFTX.bit.SCIRST=1;

    SciaRegs.SCIFFRX.bit.RXFFIL  = 1;  //设置FIFO深度
    SciaRegs.SCICTL1.bit.TXENA = 1;       //使能发送
    SciaRegs.SCICTL1.bit.RXENA = 1;       //使能接收

    SciaRegs.SCICTL2.bit.TXINTENA =1;
    SciaRegs.SCICTL2.bit.RXBKINTENA =1;
}
