/*******************************************************************************
 * LlcErr.h
 *
 *  Created on: 2019-11-15
 *      Author: Gavin.D
*******************************************************************************/
#ifndef LLCERR_H_
#define LLCERR_H_

#include "DSP28x_Project.h"    // Device Headerfile and Examples Include File

/*******************************************************************************
**                               宏定义
*******************************************************************************/

/*******************************************************************************
**                               相关结构体
*******************************************************************************/
// =============================================================================
// 故障状态寄存器,分2种读取方式:all,bit
// =============================================================================
struct stERR_BIT {
    // ----------保护字节--------------
    Uint16 HardwareErr: 1;  // 外部过温
    Uint16 ACOvp:       1;  // AC过压
    Uint16 ACUvp:       1;  // AC欠压
    Uint16 VBatOver:    1;  // 电池过压
    Uint16 VBatLack:    1;  // 电池欠压,在自检状态时代表电池电压过低(过低或反接)
    Uint16 BatErr:      1;  // 电池故障
    Uint16 IOutOver:    1;  // 过流,电流过高,但不是短路
    Uint16 IShort:      1;  // 输出短路,由硬件比较器触发
    Uint16 VOutOver:    1;  // 输出过压,高速判断,低速滞回
    Uint16 PFCOvp:      1;  // PFC过压
    Uint16 PFCUvp:      1;  // PFC欠压
    Uint16 TempOver:    1;  // 2级温度异常
    Uint16 TempOutOver: 1;  // 外部过温
    Uint16 LINErr:      1;  // LIN通讯故障
    Uint16 StorageErr:  1;  // 存储器故障
    Uint16 PFCTempOver: 1;  // 2级温度异常
    // ----------限制字节--------------
    Uint16 OpenCircuit: 1;  // 存储器故障
    Uint16 ChargeEnd:   1;  // 充电完成
    Uint16 RsvdBit1:    4;
    // ----------保留字节--------------
    Uint16 rsvd:        9;  // 保留位,未定义
};

union unERRSTAT {
    Uint32 all;                 // 全寄存器
    struct stERR_BIT  bit;      // 单个异常列表
};

extern volatile union unERRSTAT SysErr;    // 系统异常状态

/*******************************************************************************
**                               变量声明
*******************************************************************************/

/*******************************************************************************
**                               函数声明
*******************************************************************************/
extern void InitErrPara(void);
extern void CheckErr(void);

#endif /* LLCERR_H_ */
